//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьПерваяДатаРавная(Парам01)","УМеняЕстьПерваяДатаРавная","Допустим у меня есть первая дата равная 21.05.1973");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьВтораяДатаРавная(Парам01)","УМеняЕстьВтораяДатаРавная","И у меня есть вторая дата равная 31.07.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатВычисленияКоличестваМесяцевБудетРавен(Парам01)","РезультатВычисленияКоличестваМесяцевБудетРавен","Тогда результат вычисления количества месяцев будет равен 518");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть первая дата равная 21.05.1973
//@УМеняЕстьПерваяДатаРавная(Парам01)
Процедура УМеняЕстьПерваяДатаРавная(ПерваяДата) Экспорт
	 Контекст.Вставить("ПерваяДата",ПерваяДата); 
КонецПроцедуры

&НаКлиенте
//И у меня есть вторая дата равная 31.07.2016
//@УМеняЕстьВтораяДатаРавная(Парам01)
Процедура УМеняЕстьВтораяДатаРавная(ВтораяДата) Экспорт
	 Контекст.Вставить("ВтораяДата",ВтораяДата); 
КонецПроцедуры

&НаКлиенте
//Тогда результат вычисления количества месяцев будет равен 518
//@РезультатВычисленияКоличестваМесяцевБудетРавен(Парам01)
Процедура РезультатВычисленияКоличестваМесяцевБудетРавен(ОжидаемыйРезультат) Экспорт
	Результат = ОбщийМодуль_ДЗ_2.ПолучитьРазниуДатВМесяцах(Контекст.ПерваяДата,Контекст.ВтораяДата);
	Если НЕ Результат = ОжидаемыйРезультат Тогда
		ВызватьИсключение "Результат расчитан не верно";
	КонецЕсли;	
КонецПроцедуры

//окончание текста модуля