# encoding: utf-8
# language: ru

Функционал: Вычисление возраста человека в месяцах
	Как кадровик
	Хочу получать результат вычисления возраста человека в месяцах
	Чтобы отчитываться перед директором

Сценарий: вычисление количества месяцев между 21.05.1973 и 31.07.2016
	Допустим у меня есть первая дата равная 21.05.1973
	И у меня есть вторая дата равная 31.07.2016
	Тогда результат вычисления количества месяцев будет равен 518


Сценарий: вычисление количества месяцев между 05.12.1989 и 15.08.2016
	Допустим у меня есть первая дата равная 05.12.1989
	И у меня есть вторая дата равная 15.08.2016
	Тогда результат вычисления количества месяцев будет равен 320
